<template>
  <div class="overflow-y-auto scroll h-full scroll overflow-x-hidden p-5">
    <div class="flex items-center justify-between">
      <div class="text-xl font-semibold">
        Фойдаланиш қоидалари
      </div>
      <i class="bx bx-x text-2xl hover:bg-gray-100 p-2 rounded-md cursor-pointer" @click="onClose('canceled')" />
    </div>
    <div class="text-base font-medium">
      ПРАВИЛА ПОЛЬЗОВАНИЯ САЙТОМ И ПРИЛОЖЕНИЕМ AGROMART.UZ
    </div>
    <div class="my-2">
      Администрация Сайта предоставляет возможность воспользоваться Сайтом, ресурсами и сервисами в соответствии с условиями настоящих правил пользования сайтом, ресурсами и сервисами (далее – «настоящие Правила»). Обращаем Ваше внимание, что настоящие Правила являются публичной офертой. Пожалуйста, внимательно прочтите настоящие Правила.
    </div>
    <div>Настоящие Правила определяют условия использования и функционирования Сайта и приложения Agromart.uz, а также обязанности его Пользователей и Администрации Сайта. Настоящие Правила распространяют свое действие также на отношения, касающиеся прав и законных интересов третьих лиц, которые не являются Пользователями Сайта, но чьи права и законные интересы могут быть затронуты в результате деяний (действия и/или бездействия) Пользователей Сайта.</div>
    <div class="my-4 font-medium">
      1. Основные определения
    </div>
    <div>Администрация Сайта (Администрация) – представители сайта Agromart.uz. Пользователь Сайта - физическое лицо, являющееся посетителем или пользователем сайта/приложения Agromart.uz, имеющее аутентификационные данные на Сайте, тем самым имеющее доступ к Сайту, приложению посредством сети Интернет и подтвердившее согласие с настоящими Правилами, а также принявшее на себя права и обязанности, обусловленные использованием и функционированием Сайта и приложением Agromart.uz, несущее ответственность в соответствии с действующим законодательством Республики Узбекистан и общепризнанными принципами и нормами международного права.</div>
    <div class="my-2">
      Сайт – интернет-сайт Администрации, то есть совокупность, состоящая из программы, обеспечивающей его функционирование, графического решения (дизайна) и информационного наполнения, расположенных в адресном пространстве домена https://agromart.uz.
    </div>
    <div class="my-2">
      Совокупность сайтов – Сайт и/или иные интернет-сайты третьих лиц, открытые для Пользователя Сайта на основании соглашений Администрации с соответствующими третьими лицами.
    </div>
    <div class="my-2">
      Ресурсы и сервисы - ресурсы и сервисы, предназначенные для Пользователя Сайта, размещенные непосредственно на Сайте и/или на иных интернет-сайтах третьих лиц, являющихся открытыми для Пользователя Сайта на основании соглашений Администрации с соответствующими третьими лицами, и предоставляющие Пользователю Сайта возможность доступа к видеозаписям (видеофильмам), аудиозаписям, звукам, изображениям, иллюстрациям, текстам, книгам, элементам дизайна, программам для ЭВМ, включая игры и приложения, и прочему (далее – Контент), которые являются результатами интеллектуальной деятельности, права на которые принадлежат Администрации Сайта, Пользователям Сайта или любым иным лицам, либо не являющиеся результатами интеллектуальной деятельности.
    </div>
    <div class="my-2">
      Аутентификационные данные — уникальные логин и пароль Пользователя Сайта, используемые для доступа к Личному кабинету из сети Интернет или доступа к соответствующим ресурсам и сервисам Сайта, предоставляющие возможность использовать ресурсы и сервисы Сайта, а также размещать информацию и объекты (в том числе фотографии, видеозаписи, видеофильмы, аудиозаписи, звуки, изображения, иллюстрации и прочее), доступные для ознакомления иными Пользователями, и позволяющие Администрации идентифицировать каждого Пользователя Сайта. Логин и пароль для входа в Личный кабинет выдается Пользователю сайта при заполнении регистрационной анкеты Абонента в рамках договора оказания услуг связи. Пароль может быть изменены в Личном кабинете в следующем порядке: для восстановления/смены пароля пользователю Сайта следует обратиться e-mail: info@agromart.uz , при обращении необходимо сообщить ФИО и паспортные данные.
    </div>
    <div class="my-2 font-medium">
      2. Обязанности Пользователя Сайта
    </div>
    <div>
      2.1. Используя ресурсы и сервисы Совокупности сайтов, Пользователь Сайта обязан:
    </div>
    <div class="my-2">
      - соблюдать положения действующего законодательства Республики Узбекистан, настоящих Правил и иных имеющих правовой характер документов Администрации;
    </div>
    <div>
      - предоставлять при регистрации достоверные, полные и актуальные данные, следить за их актуализацией;
    </div>
    <div>
      - информировать Администрацию о несанкционированном доступе к Личному кабинету и/или о несанкционированном доступе и/или использовании пароля и логина Пользователя;
    </div>
    <div>
      - не предоставлять доступ другим Пользователям к собственной Личному кабинету или к отдельной содержащейся на ней информации в случае, если это может привести к нарушению действующего законодательства и/или настоящих Правил, иных правовых актов Администрации;
    </div>
    <div>
      - не размещать на Сайте информацию и объекты, например, чужие тексты, изображения, иллюстрации, аудиозаписи, видеозаписи (видеофильмы) и прочее, (в том числе ссылки на них), которые могут нарушать права и законные интересы других лиц, включая авторские и смежные права;
    </div>
    <div>
      - обеспечивать сохранность тайны и не предоставлять другим Пользователям Сайта и третьим лицам ставшие ему известными в результате общения с другими Пользователями и иного использования Сайта персональные данные, например, домашние адреса, номера телефонов, адреса электронной почты, паспортные данные, банковская информация и прочее, и информацию о частной жизни других Пользователей и третьих лиц без получения соответствующего предварительного разрешения последних;
    </div>
    <div class="my-2">
      2.2. В случае наличия сомнений в отношении законности осуществления тех или иных деяний, включая действия по размещению информации и/или объектов или предоставлению доступа, Администрация рекомендует воздержаться от осуществления последних.
    </div>
    <div>
      2.3. Пользователю Сайта при использовании Сайта запрещается:
    </div>
    <div>
      2.3.1. загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать любые информацию и объекты, которая:
    </div>
    <div>
      - нарушает права и законные интересы несовершеннолетних лиц;
    </div>
    <div>
      - содержит угрозы, оскорбляет, порочит честь и достоинство или деловую репутацию или нарушает неприкосновенность частной жизни других Пользователей Сайта или третьих лиц;
    </div>
    <div>
      - содержит нецензурную лексику, порнографические изображения и тексты или сцены сексуального характера с участием несовершеннолетних лиц;
    </div>
    <div>
      - содержит сцены насилия либо жестокого обращения с животными;
    </div>
    <div>
      - содержит описание средств и способов суицида, любое подстрекательство к его совершению;
    </div>
    <div>
      - пропагандирует и/или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, пропагандирует фашизм, свержение власти или идеологию расового превосходства;
    </div>
    <div>
      - содержит экстремистские материалы;
    </div>
    <div>
      - пропагандирует преступную деятельность или содержит советы, инструкции или руководства по совершению преступных действий;
    </div>
    <div>
      - содержит информацию ограниченного доступа(государственная тайна, коммерческая тайна, информация о частной жизни третьих лиц);
    </div>
    <div>
      - содержит рекламу или пропагандирует употребление наркотических веществ, в том числе «цифровых наркотиков» (звуковых файлов, воздействующих на мозг человека за счет бинауральных ритмов), информацию о распространении наркотиков, рецепты их изготовления и советы по употреблению;
    </div>
    <div>
      - носит мошеннический характер;
    </div>
    <div>
      - а также нарушает иные права и законные интересы физических и юридических лиц или требования действующего законодательства Республики Узбекистан.
    </div>
    <div class="my-2">
      2.3.2. незаконно загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать интеллектуальную собственность других Пользователей Сайта и третьих лиц;
    </div>
    <div class="my-2">
      2.3.3. использовать программное обеспечение и осуществлять действия, направленные на нарушение нормального функционирования Сайта и его сервисов или персональных страниц Пользователей Сайта;
    </div>
    <div class="my-2">
      2.3.4. осуществлять массовые рассылки сообщений без согласия Пользователей Сайта;
    </div>
    <div class="my-2">
      2.3.5. загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать вирусы, трояны и другие вредоносные программы;
    </div>
    <div class="my-2">
      2.3.6. использовать без специального на то разрешения Администрации автоматизированные скрипты (программы) для сбора информации на Сайте и/или) взаимодействия с Сайтом и его сервисами;
    </div>
    <div class="my-2">
      2.3.7. любым способом, например, путем обмана, злоупотребления доверием, взлома и прочее, пытаться получить доступ к логину и паролю других Пользователей Сайта;
    </div>
    <div class="my-2">
      2.3.8. осуществлять незаконные сбор и обработку персональных данных других Пользователей или третьих лиц;
    </div>
    <div class="my-2">
      2.3.9. осуществлять (пытаться получить) доступ к каким-либо ресурсам и/или сервисам иным способом, кроме как через интерфейс, предоставленный Администрацией, за исключением случаев, когда такие действия были прямо разрешены Пользователю в соответствии с отдельным соглашением с Администрацией;
    </div>
    <div class="my-2">
      2.3.10. воспроизводить, дублировать, копировать, продавать, осуществлять торговые операции и перепродавать размещенные на ресурсах и/или сервисах видеозаписи, аудиозаписи, звуки, иллюстрации, книги, элементы дизайна, программамы для ЭВМ, включая игры и приложения, которые являются результатами интеллектуальной деятельности, для каких-либо целей, за исключением случаев, когда такие действия были прямо разрешены Пользователю Сайта в соответствии с условиями отдельного соглашения с Администрацией;
    </div>
    <div class="my-2">
      2.3.11. размещать коммерческую и иную рекламу вне специальных разделов Сайта, установленных Администрацией. Приобретение Пользователем Сайта платных услуг на Сайте производится в порядке, установленном в специальных документах Администрации, размещенных на Сайте.
    </div>
    <div class="my-2">
      2.3.12. размещать любую другую информацию или объекты, которая, по личному мнению Администрации, является нежелательной, не соответствует целям создания Сайта, ущемляет законные интересы других Пользователей Сайта или по другим причинам является нежелательной для размещения на Сайте.
    </div>
    <div class="my-2">
      2.4. Пользователь Сайта несет личную ответственность за любую информацию, которую размещает на Сайте, сообщает другим Пользователям Сайта, а также за любые взаимодействия с другими Пользователями Сайта, осуществляемые на свой риск.
    </div>
    <div class="my-2">
      2.5. В случае несогласия Пользователя Сайта с настоящими Правилами или их изменениями, Пользователь Сайта обязан отказаться от его использования (использования ресурсов и сервисов), проинформировав об этом Администрацию Сайта в установленном порядке.
    </div>
    <div class="font-semibold my-4">
      3. Положения об интеллектуальной собственности
    </div>
    <div>
      3.1. Исключительные права на Контент, размещенный на Сайте, ресурсах и сервисах.
    </div>
    <div class="my-2">
      3.1.1. Все объекты, размещенные на Сайте, ресурсах и сервисах, включая видеозаписи (видеофильмы), аудиозаписи, звуки, изображения, иллюстрации, текст, книги, элементы дизайна, программы для ЭВМ, в том числе игры и приложения и иные объекты и их подборки (Контент), являются объектами исключительных прав Администрации, Пользователей Сайта и других правообладателей, все права на эти объекты защищены.
    </div>
    <div class="my-2">
      3.1.2. Кроме случаев, установленных настоящими Правилами, а также действующим законодательством Республики Узбекистан, никакой Контент не может быть скопирован (воспроизведен), переработан, распространен, отображен во фрейме, опубликован, скачан, передан, продан или иным способом использован целиком или по частям без предварительного разрешения правообладателя, кроме случаев, когда правообладатель явным образом выразил свое согласие на свободное использование Контента любым лицом.
    </div>
    <div class="my-2">
      3.1.3. Пользователь Сайта, размещая на Сайте, ресурсах и сервисах принадлежащий ему на законных основаниях Контент, предоставляет другим Пользователям Сайта неисключительное раво на его использование путем просмотра, воспроизведения (в том числе копирования), переработку (в том числе на распечатку копий) и иные права исключительно с целью личного некоммерческого использования, кроме случаев, когда такое использование причиняет или может причинить вред охраняемым законом интересам правообладателя.
    </div>
    <div class="my-2">
      3.1.4. Использование Пользователем Сайта Контента, доступ к которому получен исключительно для личного некоммерческого использования, допускается при условии сохранения всех знаков авторства (копирайтов) или других уведомлений об авторстве, сохранения имени автора в неизменном виде, сохранении произведения в неизменном виде.
    </div>
    <div class="my-2">
      3.1.5. Пользователю запрещается загружать или иным образом доводить до всеобщего сведения (публиковать на Сайте, ресурсах и сервисах) Контент других сайтов, баз данных и прочие результаты интеллектуальной деятельности при отсутствии явным образом выраженного согласия правообладателя на такие действия, за исключением своего собственного Контента, на которые у него есть исключительные права.
    </div>
    <div class="my-2">
      3.1.6. Любое использование Сайта, ресурсов, сервисов или Контента, кроме разрешенного в настоящих Правилах или в случае явно выраженного согласия правообладателя на такое использование, без предварительного письменного разрешения правообладателя, категорически запрещено.
    </div>
    <div class="my-2">
      3.1.7. Если иное явным образом не установлено в настоящих Правилах, ничто в настоящих Правилах не может быть рассмотрено как передача исключительных прав на Контент.
    </div>
    <div class="my-2">
      3.2. Ответственность за нарушение исключительных прав.
    </div>
    <div class="my-2">
      3.2.1. Пользователь Сайта несет личную ответственность за любой Контент или иную информацию и объекты, которые он загружает или иным образом доводит до всеобщего сведения (публикует) на Сайте, ресурсах, сервисах или с его помощью. Пользователь не вправе загружать, передавать или публиковать Контент на Сайте, если он у него отсутствуют соответствующие права на совершение таких действий, приобретенные илиаывх ограничений перемещения или удаления Контента, который, по личному мнению Администрации, нарушает настоящие Правила, действующее законодательство Республики Узбекистан, общепризнанные принципы и нормы международного права и/или может нарушать права, причинить вред или угрожать безопасности других Пользователей Сайта или третьих лиц. 3.2.3. Размещая свой Контент на Сайте, ресурсах и сервисах, Пользователь Сайта передает Администрации право делать копии своего Контента с целью упорядочения и облегчения публикации и хранения пользовательского Контента на Сайте, ресурсах и сервисах.
    </div>
    <div class="my-2">
      3.2.4. Размещая свой Контент в любой части Сайта, ресурсах и сервисах, Пользователь Сайта автоматически безвозмездно предоставляет Администрации неисключительное право на его использование путем копирования, публичного исполнения, воспроизведения, переработки, перевода и распространения для целей Сайта, ресурсов и сервисов или в связи с ними, в том числе для его популяризации. Для указанных целей Администрация может изготавливать производные Контента или вставлять Контент Пользователя Сайта в качестве составных частей в соответствующие сборники, осуществлять иные действия, связанные с достижением указанных целей.
    </div>
    <div class="my-2">
      3.2.5. Если Пользователь Сайта удаляет свой Контент с Сайта, ресурсов и сервисов, права, упомянутые в п. 3.2.3 – 3.2.4 настоящих Правил, будут автоматически отозваны, однако Администрация вправе сохранять архивные копии пользовательского Контента в течение неопределенного срока.
    </div>
    <div class="my-2">
      3.3. Интернет-сайты и Контент третьих лиц.
    </div>
    <div class="my-2">
      3.3.1. Сайт, ресурсы и сервисы, Совокупность сайтов содержат (или могут содержать) ссылки на другие интернет-сайты (сайты третьих лиц) так же, как и статьи, фотографии, иллюстрации, изображения, аудиозаписи, звуки, видеозаписи (видеофильмы), информацию, программы для ЭВМ, в том числе игры и приложения, программы и другой Контент, принадлежащий или исходящий от третьих лиц (Контент третьих лиц), являющийся результатом интеллектуальной деятельности и охраняемых в соответствии с действующим законодательством Республики Узбекистан.
    </div>
    <div class="my-2">
      3.3.2. Указанные третьи лица и их Контент не проверяются Администрацией на соответствие тем или иным требованиям (достоверности, полноты, добросовестности и т.п.). Администрация не несет ответственность за любую информацию, размещенную на интернет-сайтах третьих лиц, к которым Пользователь Сайта получает доступ через Сайт, ресурсы и сервисы или через Контент третьих лиц, включая, в том числе, любые мнения и/или утверждения, выраженные на интернет- сайтах третьих лиц или в их Контенте.
    </div>
    <div class="my-2">
      3.3.3. Размещенные на Сайте, ресурсах и сервисах ссылки или руководства по скачиванию файлов и/или установке программ третьих лиц не означают поддержки или одобрения таких действий со стороны Администрации.
    </div>
    <div class="my-2" />
    <div class="my-2">
      3.3.4. Ссылка на любой интернет-сайт, продукт, услугу, любую информацию коммерческого или некоммерческого характера, размещенная на Сайте, ресурсах и сервисах, не является одобрением или рекомендацией данных продуктов (услуг) со стороны Администрации.
    </div>
    <div class="my-2">
      3.3.5. Если Пользователь Сайта решил покинуть Сайт, ресурсы и сервисы и перейти к интернет- сайтам третьих лиц или использовать, или установить программы третьих лиц, он делает это на свой риск и с этого момента настоящие Правила более не распространяются на Пользователя Сайта. При дальнейших действиях Пользователю Сайта стоит руководствоваться применимыми нормами и политикой, в том числе деловыми обычаями тех лиц, чей Контент он собирается использовать.
    </div>
    <div class="my-4 font-medium">
      4. Прочие положения
    </div>
    <div class="my-2">
      4.1. Обращения, предложения и претензии физических и юридических лиц к Администрации в связи с настоящими Правилами и всеми вопросами по функционированию Сайта, ресурсов и сервисов, нарушениями прав и интересов третьих лиц при его использовании, а также для запросов уполномоченных действующим законодательством Республики Узбекистан лиц могут быть направлены на электронный адрес: info@agromart.uz
    </div>
    <div class="my-2">
      4.2. Выбранные Пользователем Сайта логин и пароль являются необходимой и достаточной информацией для доступа Пользователя на Сайт, ресурсам и сервисам. Пользователь Сайта не имеет права передавать свои логин и пароль третьим лицам, несет полную ответственность за их сохранность, самостоятельно выбирая способ их хранения. Пользователь Сайта на используемом им аппаратно-программном обеспечении может разрешить хранение логина и пароля (с использованием файлов cookies) для последующей автоматической авторизации на Сайте.
    </div>
    <div class="my-2">
      4.3. Если Пользователем Сайта не доказано обратное, любые действия, совершенные с использованием его логина и пароля, считаются совершенными соответствующим Пользователем. В случае несанкционированного доступа к логину и паролю и/или персональной странице Пользователя Сайта, или распространения логина и пароля Пользователь Сайта обязан незамедлительно сообщить об этом Администрации в установленном порядке.
    </div>
    <div class="my-2">
      4.4. Пользователи Сайта несут ответственность за собственные действия в связи с созданием и размещением информации и/или объектов на Сайте, ресурсах и сервисах в соответствии с действующим законодательством Республики Узбекистан. Предупреждаем, что нарушение настоящих Правил и действующего законодательства Республики Узбекистан влечет за собой гражданско-правовую, административную и уголовную ответственность.
    </div>
    <div class="my-2">
      4.5. Администрация предоставляет техническую возможность использования Сайта, ресурсов и сервисов Пользователями Сайта, не участвует в формировании Пользователями Сайта Контента и не контролирует и не несет ответственности за деяния (действия и/или бездействие) любых лиц в отношении использования Сайта, ресурсов и сервисов или формирования и использования Пользователями Контента на Сайте, ресурсах и сервисах.
    </div>
    <div class="my-2">
      4.6. В информационной системе Сайта, ресурсах и сервисах и его программном обеспечении отсутствуют технические решения, осуществляющие автоматические цензуру и контроль деяний (действий и/или бездействия) Пользователей Сайта, информационных отношений Пользователей Сайта по использованию Сайта, ресурсов и сервисов.
    </div>
    <div class="my-2">
      4.7. Администрация сохраняет за собой право в любое время изменять оформление Сайта, ресурсов и сервисов, его содержание, список ресурсов и сервисов, изменять или дополнять используемые скрипты, программное обеспечение и другие объекты, используемые или хранящиеся на Сайте, любые серверные приложения в любое время с предварительным уведомлением или без такового.
    </div>
    <div class="my-2" />
    <div class="my-2">
      4.8. Администрация не занимается предварительной модерацией или цензурой информации Пользователей Сайта и предпринимает действия по защите прав и законных интересов физических или юридических лиц и обеспечению соблюдения требований действующего законодательства Республики Узбекистан только после обращения заинтересованного лица к Администрации в установленном порядке.
    </div>
    <div class="my-2">
      4.9. Администрация не несет ответственности за нарушение Пользователем настоящих Правил и оставляет за собой право по своему собственному усмотрению, а также при получении информации от других Пользователей Сайта либо третьих лиц о нарушении Пользователем Сайта настоящих Правил, изменять (модерировать) или удалять любую публикуемую Пользователем информацию и/или объекты, нарушающие запреты, установленные настоящими Правилами (включая личные сообщения), приостанавливать, ограничивать или прекращать доступ Пользователя ко всем или к любому из разделов или сервисов Сайта в любое время по любой причине или без объяснения причин, с предварительным уведомлением или без такового, не отвечая за любой вред, который может быть причинен Пользователям Сайта таким действием. Администрация не несет ответственности за осуществленное в соответствии с настоящими Правилами временное блокирование или удаление информации и/или объекты, которые были размещены Пользователем Сайта.
    </div>
    <div class="my-2">
      4.10. Администрация обеспечивает функционирование Сайта, ресурсов и сервисов и обязуется оперативно восстанавливать его работоспособность в случае технических сбоев и перерывов. Администрация не несет ответственности за временные сбои и перерывы в работе Сайта, ресурсы и сервисы и вызванные ими потерю информации. Администрация не несет ответственности за любой ущерб компьютеру Пользователя Сайта или иного лица, мобильным устройствам, любому другому оборудованию или программному обеспечению, вызванный или связанный со скачиванием материалов с Сайта, ресурсов и сервисов или по ссылкам, размещенным на Сайте. 4.11. Администрация имеет право распоряжаться статистической информацией, связанной с функционированием Сайта, ресурсов и сервисов, а также информацией и объектами Пользователей Сайта для обеспечения адресного показа рекламной информации различным аудиториям Пользователей Сайта. Для целей организации функционирования и технической поддержки Сайта, ресурсов и сервисов и исполнения настоящих Правил Администрация имеет техническую возможность доступа к Профилям Пользователей Сайта, которую реализует только в случаях, установленных настоящими Правилами.
    </div>
    <div class="my-2">
      4.12. Администрация имеет право направлять Пользователю Сайта информацию о развитии Сайта, ресурсов и сервисов, а также рекламировать собственную деятельность и услуги.
    </div>
    <div class="my-2">
      4.13. Ограничение ответственности Администрации:
    </div>
    <div class="my-2">
      - Сайт, ресурсы и сервисы, в том числе все приложения, скрипты, иной Контент, поставляются «как есть». Администрация не гарантирует того, что Сайт, ресурсы и сервисы могут подходить или не подходить для конкретных целей использования. Администрация не гарантирует и не дает обещания на получение специфических результатов от использования Сайта, ресурсов и сервисов. - Во избежание недоразумений и претензий со стороны третьих лиц Пользователю Сайта необходимо соблюдать меры предосторожности в скачивании с Сайта, ресурсов и сервисов или по размещенных на них ссылках, и использовании любых файлов, включая программное обеспечение.
    </div>
    <div class="my-2">
      - Используя Сайт, ресурсы и сервисы Пользователь Сайта удостоверяет этим, что скачивает с Сайта, ресурсов и сервисов или с их помощью любую информацию и объекты на свой собственный риск и несет личную ответственность за возможные последствия их использования, в том числе за ущерб, который может быть причинен компьютеру Пользователя Сайта или третьим лицам, за потерю данных или любой иной вред.
    </div>
    <div class="my-2" />
    <div class="my-2" />
    <div class="my-2">
      - Ни при каких обстоятельствах Администрация и/или ее представители не несут ответственность перед Пользователем Сайта или третьими лицами за любой косвенный, случайный, неумышленный ущерб, в том числе упущенную выгоду или потерянные данные, информацию, вред чести, достоинству или деловой репутации, вызванный в связи с использованием Сайта, ресурсов и сервисов или иных материалов, к которым Пользователь Сайта получил доступ с помощью Сайта, ресурсов и сервисов.
    </div>
    <div class="my-2">
      4.14. Обработка персональных данных Пользователя Сайта осуществляется в соответствии с законодательством Республики Узбекистан. Администрация обрабатывает персональные данные Пользователя в целях предоставления Пользователю услуг, в том числе, в целях получения Пользователем персонализированной (таргетированной) рекламы; проверки, исследования и анализа таких данных, позволяющих поддерживать и улучшать ресурсы и сервисы Сайта, а также разрабатывать новые ресурсы и сервисы Сайта. Администрация принимает все необходимые меры для защиты персональных данных Пользователя Сайта от неправомерного доступа, изменения, раскрытия или уничтожения. Администрация предоставляет доступ к персональным данным Пользователя Сайта только тем работникам, подрядчикам и агентам Администрации, которым эта информация необходима для обеспечения функционирования Сайта и предоставления услуг Пользователю Сайта. Администрация вправе использовать предоставленную Пользователем информацию, в том числе персональные данные, в целях обеспечения соблюдения требований действующего законодательства Республики Узбекистан (в том числе в целях предупреждения и/или пресечения незаконных и/или противоправных действий Пользователей Сайта). Раскрытие предоставленной Пользователем Сайта информации может быть произведено лишь в соответствии с действующим законодательством Республики Узбекистан по требованию суда, правоохранительных органов, а равно в иных предусмотренных действующим законодательством Республики Узбекистан случаях. Поскольку Администрация осуществляет обработку персональных данных Пользователя Сайта в целях исполнения заключенного договора между Администрацией и Пользователем Сайта на оказание услуг связи, в силу положений законодательства о персональных данных согласие Пользователя на обработку его персональных данных не требуется.
    </div>
    <div class="my-2">
      4.15. Администрация оставляет право отправлять смс-уведомления зарегистрированным пользователям о новостях Сайта, а также сообщения рекламного характера.
    </div>
    <div class="my-2">
      4.15. В случае возникновения любых споров или разногласий, связанных с исполнением настоящих Правил, Пользователь Сайта и Администрация приложат все усилия для их разрешения путем проведения переговоров между ними. В случае, если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном действующим законодательством Республики Узбекистан.
    </div>
    <div class="my-2">
      4.16. Настоящие Правила вступают в силу для Пользователя Сайта с момента его присоединения к ним и действуют в течение неопределенного срока.
    </div>
    <div class="my-2">
      4.17. Если по тем или иным причинам одно или несколько положений настоящих Правил будут признаны недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений настоящих Правил.
    </div>
    <div class="my-2">
      4.18. Настоящие Правила могут быть изменены и/или дополнены Администрацией в одностороннем порядке без какого-либо специального уведомления. Настоящие Правила являются открытым и общедоступным документом. Действующая редакция Правил располагается в сети Интернет по адресу: https://agromart.uz/ru/useful-information/user-agreement . Администрация Сайта рекомендует Пользователям Сайта регулярно проверять условия настоящих Правил на предмет их изменения и/или дополнения. Продолжение использования Сайта Пользователем после внесения изменений и/или дополнений в настоящие Правила означает принятие и согласие Пользователя Сайта с такими изменениями и/или дополнениями.
    </div>
    <div class="my-2">
      4.19. Настоящие Правила регулируются и толкуются в соответствии с действующим законодательством Республики Узбекистан. Вопросы, не урегулированные настоящими Правилами, подлежат разрешению в соответствии с действующим законодательством Республики Узбекистан.
    </div>
  </div>
</template>

<script>
export default {
  name: 'TermsOfService',
  methods: {
    onClose (e) {
      this.$emit('close')
      this.$root.$emit('ads-notification-modal', e)
    }
  }
}
</script>
